# Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, если разрешается сделать один разлом по прямой
# между дольками (то есть разломить шоколадку на два прямоугольника).

print("Hello! this is a program that asks for an input for a chocolate sides and divides it into 2 separate parts")
siden = int(input("Please enter a number for the side N: "))
sidem = int(input("Now please enter the number for side M: "))
